HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief CCE, Read Data and Bit Flip Register 55 */
#define MTU_MC12_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCEu)

/** \brief CD0, Read Data and Bit Flip Register 56 */
#define MTU_MC12_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD0u)

/** \brief CD2, Read Data and Bit Flip Register 57 */
#define MTU_MC12_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD2u)

/** \brief CD4, Read Data and Bit Flip Register 58 */
#define MTU_MC12_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD4u)

/** \brief CD6, Read Data and Bit Flip Register 59 */
#define MTU_MC12_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD6u)

/** \brief CD8, Read Data and Bit Flip Register 60 */
#define MTU_MC12_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD8u)

/** \brief CDA, Read Data and Bit Flip Register 61 */
#define MTU_MC12_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CDAu)

/** \brief CDC, Read Data and Bit Flip Register 62 */
#define MTU_MC12_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CDCu)

/** \brief CDE, Read Data and Bit Flip Register 63 */
#define MTU_MC12_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CDEu)

/** \brief CE0, Read Data and Bit Flip Register 64 */
#define MTU_MC12_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CE0u)

/** \brief CE2, Read Data and Bit Flip Register 65 */
#define MTU_MC12_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CE2u)

/** \brief CE4, Read Data and Bit Flip Register 66 */
#define MTU_MC12_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CE4u)

/** \brief CEE, Alarm Sources Configuration Register */
#define MTU_MC12_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061CEEu)

/** \brief CF0, SSH Safety Faults Status Register  */
#define MTU_MC12_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061CF0u)

/** \brief CF2, Error Information Register 0 */
#define MTU_MC12_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF2u)

/** \brief CF4, Error Information Register 1 */
#define MTU_MC12_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF4u)

/** \brief CF6, Error Information Register 2 */
#define MTU_MC12_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF6u)

/** \brief CF8, Error Information Register 3 */
#define MTU_MC12_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF8u)

/** \brief CFA, Error Information Register 4 */
#define MTU_MC12_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CFAu)

/** \brief D00, Configuration Registers */
#define MTU_MC13_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061D00u)

/** \brief D02, Configuration Register 1 */
#define MTU_MC13_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061D02u)

/** \brief D04, MBIST Control Register */
#define MTU_MC13_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061D04u)

/** \brief D06, Status Register */
#define MTU_MC13_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061D06u)

/** \brief D08, Range Register, single address mode */
#define MTU_MC13_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061D08u)

/** \brief D0C, Revision ID Register */
#define MTU_MC13_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061D0Cu)

/** \brief D0E, ECC Safety Register */
#define MTU_MC13_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061D0Eu)

/** \brief D10, Memory ECC Detection Register */
#define MTU_MC13_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061D10u)

/** \brief D12, Error Tracking Register 0 */
#define MTU_MC13_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D12u)

/** \brief D14, Error Tracking Register 1 */
#define MTU_MC13_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D14u)

/** \brief D16, Error Tracking Register 2 */
#define MTU_MC13_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D16u)

/** \brief D18, Error Tracking Register 3 */
#define MTU_MC13_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D18u)

/** \brief D1A, Error Tracking Register 4 */
#define MTU_MC13_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D1Au)

/** \brief D60, Read Data and Bit Flip Register 0 */
#define MTU_MC13_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D60u)

/** \brief D62, Read Data and Bit Flip Register 1 */
#define MTU_MC13_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D62u)

/** \brief D64, Read Data and Bit Flip Register 2 */
#define MTU_MC13_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D64u)

/** \brief D66, Read Data and Bit Flip Register 3 */
#define MTU_MC13_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D66u)

/** \brief D68, Read Data and Bit Flip Register 4 */
#define MTU_MC13_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D68u)

/** \brief D6A, Read Data and Bit Flip Register 5 */
#define MTU_MC13_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Au)

/** \brief D6C, Read Data and Bit Flip Register 6 */
#define MTU_MC13_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Cu)

/** \brief D6E, Read Data and Bit Flip Register 7 */
#define MTU_MC13_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Eu)

/** \brief D70, Read Data and Bit Flip Register 8 */
#define MTU_MC13_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D70u)

/** \brief D72, Read Data and Bit Flip Register 9 */
#define MTU_MC13_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D72u)

/** \brief D74, Read Data and Bit Flip Register 10 */
#define MTU_MC13_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D74u)

/** \brief D76, Read Data and Bit Flip Register 11 */
#define MTU_MC13_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D76u)

