HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief D78, Read Data and Bit Flip Register 12 */
#define MTU_MC13_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D78u)

/** \brief D7A, Read Data and Bit Flip Register 13 */
#define MTU_MC13_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Au)

/** \brief D7C, Read Data and Bit Flip Register 14 */
#define MTU_MC13_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Cu)

/** \brief D7E, Read Data and Bit Flip Register 15 */
#define MTU_MC13_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Eu)

/** \brief D80, Read Data and Bit Flip Register 16 */
#define MTU_MC13_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D80u)

/** \brief D82, Read Data and Bit Flip Register 17 */
#define MTU_MC13_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D82u)

/** \brief D84, Read Data and Bit Flip Register 18 */
#define MTU_MC13_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D84u)

/** \brief D86, Read Data and Bit Flip Register 19 */
#define MTU_MC13_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D86u)

/** \brief D88, Read Data and Bit Flip Register 20 */
#define MTU_MC13_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D88u)

/** \brief D8A, Read Data and Bit Flip Register 21 */
#define MTU_MC13_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Au)

/** \brief D8C, Read Data and Bit Flip Register 22 */
#define MTU_MC13_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Cu)

/** \brief D8E, Read Data and Bit Flip Register 23 */
#define MTU_MC13_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Eu)

/** \brief D90, Read Data and Bit Flip Register 24 */
#define MTU_MC13_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D90u)

/** \brief D92, Read Data and Bit Flip Register 25 */
#define MTU_MC13_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D92u)

/** \brief D94, Read Data and Bit Flip Register 26 */
#define MTU_MC13_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D94u)

/** \brief D96, Read Data and Bit Flip Register 27 */
#define MTU_MC13_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D96u)

/** \brief D98, Read Data and Bit Flip Register 28 */
#define MTU_MC13_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D98u)

/** \brief D9A, Read Data and Bit Flip Register 29 */
#define MTU_MC13_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Au)

/** \brief D9C, Read Data and Bit Flip Register 30 */
#define MTU_MC13_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Cu)

/** \brief D9E, Read Data and Bit Flip Register 31 */
#define MTU_MC13_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Eu)

/** \brief DA0, Read Data and Bit Flip Register 32 */
#define MTU_MC13_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA0u)

/** \brief DA2, Read Data and Bit Flip Register 33 */
#define MTU_MC13_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA2u)

/** \brief DA4, Read Data and Bit Flip Register 34 */
#define MTU_MC13_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA4u)

/** \brief DA6, Read Data and Bit Flip Register 35 */
#define MTU_MC13_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA6u)

/** \brief DA8, Read Data and Bit Flip Register 36 */
#define MTU_MC13_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA8u)

/** \brief DAA, Read Data and Bit Flip Register 37 */
#define MTU_MC13_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DAAu)

/** \brief DAC, Read Data and Bit Flip Register 38 */
#define MTU_MC13_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DACu)

/** \brief DAE, Read Data and Bit Flip Register 39 */
#define MTU_MC13_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DAEu)

/** \brief DB0, Read Data and Bit Flip Register 40 */
#define MTU_MC13_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB0u)

/** \brief DB2, Read Data and Bit Flip Register 41 */
#define MTU_MC13_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB2u)

/** \brief DB4, Read Data and Bit Flip Register 42 */
#define MTU_MC13_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB4u)

/** \brief DB6, Read Data and Bit Flip Register 43 */
#define MTU_MC13_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB6u)

/** \brief DB8, Read Data and Bit Flip Register 44 */
#define MTU_MC13_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB8u)

/** \brief DBA, Read Data and Bit Flip Register 45 */
#define MTU_MC13_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBAu)

/** \brief DBC, Read Data and Bit Flip Register 46 */
#define MTU_MC13_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBCu)

/** \brief DBE, Read Data and Bit Flip Register 47 */
#define MTU_MC13_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBEu)

/** \brief DC0, Read Data and Bit Flip Register 48 */
#define MTU_MC13_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC0u)

/** \brief DC2, Read Data and Bit Flip Register 49 */
#define MTU_MC13_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC2u)

/** \brief DC4, Read Data and Bit Flip Register 50 */
#define MTU_MC13_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC4u)

/** \brief DC6, Read Data and Bit Flip Register 51 */
#define MTU_MC13_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC6u)

/** \brief DC8, Read Data and Bit Flip Register 52 */
#define MTU_MC13_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC8u)

/** \brief DCA, Read Data and Bit Flip Register 53 */
#define MTU_MC13_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCAu)

/** \brief DCC, Read Data and Bit Flip Register 54 */
#define MTU_MC13_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCCu)

