HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief DCE, Read Data and Bit Flip Register 55 */
#define MTU_MC13_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCEu)

/** \brief DD0, Read Data and Bit Flip Register 56 */
#define MTU_MC13_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD0u)

/** \brief DD2, Read Data and Bit Flip Register 57 */
#define MTU_MC13_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD2u)

/** \brief DD4, Read Data and Bit Flip Register 58 */
#define MTU_MC13_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD4u)

/** \brief DD6, Read Data and Bit Flip Register 59 */
#define MTU_MC13_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD6u)

/** \brief DD8, Read Data and Bit Flip Register 60 */
#define MTU_MC13_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD8u)

/** \brief DDA, Read Data and Bit Flip Register 61 */
#define MTU_MC13_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDAu)

/** \brief DDC, Read Data and Bit Flip Register 62 */
#define MTU_MC13_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDCu)

/** \brief DDE, Read Data and Bit Flip Register 63 */
#define MTU_MC13_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDEu)

/** \brief DE0, Read Data and Bit Flip Register 64 */
#define MTU_MC13_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE0u)

/** \brief DE2, Read Data and Bit Flip Register 65 */
#define MTU_MC13_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE2u)

/** \brief DE4, Read Data and Bit Flip Register 66 */
#define MTU_MC13_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE4u)

/** \brief DEE, Alarm Sources Configuration Register */
#define MTU_MC13_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061DEEu)

/** \brief DF0, SSH Safety Faults Status Register  */
#define MTU_MC13_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061DF0u)

/** \brief DF2, Error Information Register 0 */
#define MTU_MC13_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF2u)

/** \brief DF4, Error Information Register 1 */
#define MTU_MC13_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF4u)

/** \brief DF6, Error Information Register 2 */
#define MTU_MC13_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF6u)

/** \brief DF8, Error Information Register 3 */
#define MTU_MC13_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF8u)

/** \brief DFA, Error Information Register 4 */
#define MTU_MC13_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DFAu)

/** \brief E00, Configuration Registers */
#define MTU_MC14_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061E00u)

/** \brief E02, Configuration Register 1 */
#define MTU_MC14_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061E02u)

/** \brief E04, MBIST Control Register */
#define MTU_MC14_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061E04u)

/** \brief E06, Status Register */
#define MTU_MC14_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061E06u)

/** \brief E08, Range Register, single address mode */
#define MTU_MC14_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061E08u)

/** \brief E0C, Revision ID Register */
#define MTU_MC14_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061E0Cu)

/** \brief E0E, ECC Safety Register */
#define MTU_MC14_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061E0Eu)

/** \brief E10, Memory ECC Detection Register */
#define MTU_MC14_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061E10u)

/** \brief E12, Error Tracking Register 0 */
#define MTU_MC14_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E12u)

/** \brief E14, Error Tracking Register 1 */
#define MTU_MC14_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E14u)

/** \brief E16, Error Tracking Register 2 */
#define MTU_MC14_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E16u)

/** \brief E18, Error Tracking Register 3 */
#define MTU_MC14_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E18u)

/** \brief E1A, Error Tracking Register 4 */
#define MTU_MC14_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E1Au)

/** \brief E60, Read Data and Bit Flip Register 0 */
#define MTU_MC14_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E60u)

/** \brief E62, Read Data and Bit Flip Register 1 */
#define MTU_MC14_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E62u)

/** \brief E64, Read Data and Bit Flip Register 2 */
#define MTU_MC14_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E64u)

/** \brief E66, Read Data and Bit Flip Register 3 */
#define MTU_MC14_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E66u)

/** \brief E68, Read Data and Bit Flip Register 4 */
#define MTU_MC14_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E68u)

/** \brief E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC14_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Au)

/** \brief E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC14_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Cu)

/** \brief E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC14_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Eu)

/** \brief E70, Read Data and Bit Flip Register 8 */
#define MTU_MC14_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E70u)

/** \brief E72, Read Data and Bit Flip Register 9 */
#define MTU_MC14_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E72u)

/** \brief E74, Read Data and Bit Flip Register 10 */
#define MTU_MC14_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E74u)

/** \brief E76, Read Data and Bit Flip Register 11 */
#define MTU_MC14_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E76u)

/** \brief E78, Read Data and Bit Flip Register 12 */
#define MTU_MC14_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E78u)

/** \brief E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC14_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E7Au)

