HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 1F1A, Error Tracking Register 4 */
#define MTU_MC31_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F1Au)

/** \brief 1F60, Read Data and Bit Flip Register 0 */
#define MTU_MC31_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F60u)

/** \brief 1F62, Read Data and Bit Flip Register 1 */
#define MTU_MC31_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F62u)

/** \brief 1F64, Read Data and Bit Flip Register 2 */
#define MTU_MC31_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F64u)

/** \brief 1F66, Read Data and Bit Flip Register 3 */
#define MTU_MC31_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F66u)

/** \brief 1F68, Read Data and Bit Flip Register 4 */
#define MTU_MC31_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F68u)

/** \brief 1F6A, Read Data and Bit Flip Register 5 */
#define MTU_MC31_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Au)

/** \brief 1F6C, Read Data and Bit Flip Register 6 */
#define MTU_MC31_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Cu)

/** \brief 1F6E, Read Data and Bit Flip Register 7 */
#define MTU_MC31_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Eu)

/** \brief 1F70, Read Data and Bit Flip Register 8 */
#define MTU_MC31_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F70u)

/** \brief 1F72, Read Data and Bit Flip Register 9 */
#define MTU_MC31_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F72u)

/** \brief 1F74, Read Data and Bit Flip Register 10 */
#define MTU_MC31_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F74u)

/** \brief 1F76, Read Data and Bit Flip Register 11 */
#define MTU_MC31_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F76u)

/** \brief 1F78, Read Data and Bit Flip Register 12 */
#define MTU_MC31_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F78u)

/** \brief 1F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC31_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Au)

/** \brief 1F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC31_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Cu)

/** \brief 1F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC31_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Eu)

/** \brief 1F80, Read Data and Bit Flip Register 16 */
#define MTU_MC31_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F80u)

/** \brief 1F82, Read Data and Bit Flip Register 17 */
#define MTU_MC31_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F82u)

/** \brief 1F84, Read Data and Bit Flip Register 18 */
#define MTU_MC31_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F84u)

/** \brief 1F86, Read Data and Bit Flip Register 19 */
#define MTU_MC31_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F86u)

/** \brief 1F88, Read Data and Bit Flip Register 20 */
#define MTU_MC31_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F88u)

/** \brief 1F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC31_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Au)

/** \brief 1F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC31_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Cu)

/** \brief 1F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC31_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Eu)

/** \brief 1F90, Read Data and Bit Flip Register 24 */
#define MTU_MC31_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F90u)

/** \brief 1F92, Read Data and Bit Flip Register 25 */
#define MTU_MC31_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F92u)

/** \brief 1F94, Read Data and Bit Flip Register 26 */
#define MTU_MC31_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F94u)

/** \brief 1F96, Read Data and Bit Flip Register 27 */
#define MTU_MC31_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F96u)

/** \brief 1F98, Read Data and Bit Flip Register 28 */
#define MTU_MC31_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F98u)

/** \brief 1F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC31_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Au)

/** \brief 1F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC31_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Cu)

/** \brief 1F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC31_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Eu)

/** \brief 1FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC31_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA0u)

/** \brief 1FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC31_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA2u)

/** \brief 1FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC31_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA4u)

/** \brief 1FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC31_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA6u)

/** \brief 1FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC31_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA8u)

/** \brief 1FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC31_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FAAu)

/** \brief 1FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC31_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FACu)

/** \brief 1FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC31_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FAEu)

/** \brief 1FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC31_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB0u)

/** \brief 1FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC31_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB2u)

/** \brief 1FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC31_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB4u)

/** \brief 1FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC31_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB6u)

/** \brief 1FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC31_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB8u)

/** \brief 1FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC31_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBAu)

