HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 20B4, Read Data and Bit Flip Register 42 */
#define MTU_MC32_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B4u)

/** \brief 20B6, Read Data and Bit Flip Register 43 */
#define MTU_MC32_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B6u)

/** \brief 20B8, Read Data and Bit Flip Register 44 */
#define MTU_MC32_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B8u)

/** \brief 20BA, Read Data and Bit Flip Register 45 */
#define MTU_MC32_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BAu)

/** \brief 20BC, Read Data and Bit Flip Register 46 */
#define MTU_MC32_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BCu)

/** \brief 20BE, Read Data and Bit Flip Register 47 */
#define MTU_MC32_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BEu)

/** \brief 20C0, Read Data and Bit Flip Register 48 */
#define MTU_MC32_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C0u)

/** \brief 20C2, Read Data and Bit Flip Register 49 */
#define MTU_MC32_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C2u)

/** \brief 20C4, Read Data and Bit Flip Register 50 */
#define MTU_MC32_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C4u)

/** \brief 20C6, Read Data and Bit Flip Register 51 */
#define MTU_MC32_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C6u)

/** \brief 20C8, Read Data and Bit Flip Register 52 */
#define MTU_MC32_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C8u)

/** \brief 20CA, Read Data and Bit Flip Register 53 */
#define MTU_MC32_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CAu)

/** \brief 20CC, Read Data and Bit Flip Register 54 */
#define MTU_MC32_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CCu)

/** \brief 20CE, Read Data and Bit Flip Register 55 */
#define MTU_MC32_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CEu)

/** \brief 20D0, Read Data and Bit Flip Register 56 */
#define MTU_MC32_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D0u)

/** \brief 20D2, Read Data and Bit Flip Register 57 */
#define MTU_MC32_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D2u)

/** \brief 20D4, Read Data and Bit Flip Register 58 */
#define MTU_MC32_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D4u)

/** \brief 20D6, Read Data and Bit Flip Register 59 */
#define MTU_MC32_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D6u)

/** \brief 20D8, Read Data and Bit Flip Register 60 */
#define MTU_MC32_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D8u)

/** \brief 20DA, Read Data and Bit Flip Register 61 */
#define MTU_MC32_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DAu)

/** \brief 20DC, Read Data and Bit Flip Register 62 */
#define MTU_MC32_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DCu)

/** \brief 20DE, Read Data and Bit Flip Register 63 */
#define MTU_MC32_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DEu)

/** \brief 20E0, Read Data and Bit Flip Register 64 */
#define MTU_MC32_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E0u)

/** \brief 20E2, Read Data and Bit Flip Register 65 */
#define MTU_MC32_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E2u)

/** \brief 20E4, Read Data and Bit Flip Register 66 */
#define MTU_MC32_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E4u)

/** \brief 20EE, Alarm Sources Configuration Register */
#define MTU_MC32_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00630EEu)

/** \brief 20F0, SSH Safety Faults Status Register  */
#define MTU_MC32_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00630F0u)

/** \brief 20F2, Error Information Register 0 */
#define MTU_MC32_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F2u)

/** \brief 20F4, Error Information Register 1 */
#define MTU_MC32_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F4u)

/** \brief 20F6, Error Information Register 2 */
#define MTU_MC32_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F6u)

/** \brief 20F8, Error Information Register 3 */
#define MTU_MC32_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F8u)

/** \brief 20FA, Error Information Register 4 */
#define MTU_MC32_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630FAu)

/** \brief 2100, Configuration Registers */
#define MTU_MC33_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063100u)

/** \brief 2102, Configuration Register 1 */
#define MTU_MC33_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063102u)

/** \brief 2104, MBIST Control Register */
#define MTU_MC33_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063104u)

/** \brief 2106, Status Register */
#define MTU_MC33_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063106u)

/** \brief 2108, Range Register, single address mode */
#define MTU_MC33_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063108u)

/** \brief 210C, Revision ID Register */
#define MTU_MC33_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006310Cu)

/** \brief 210E, ECC Safety Register */
#define MTU_MC33_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006310Eu)

/** \brief 2110, Memory ECC Detection Register */
#define MTU_MC33_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063110u)

/** \brief 2112, Error Tracking Register 0 */
#define MTU_MC33_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063112u)

/** \brief 2114, Error Tracking Register 1 */
#define MTU_MC33_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063114u)

/** \brief 2116, Error Tracking Register 2 */
#define MTU_MC33_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063116u)

/** \brief 2118, Error Tracking Register 3 */
#define MTU_MC33_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063118u)

/** \brief 211A, Error Tracking Register 4 */
#define MTU_MC33_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006311Au)

/** \brief 2160, Read Data and Bit Flip Register 0 */
#define MTU_MC33_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063160u)

/** \brief 2162, Read Data and Bit Flip Register 1 */
#define MTU_MC33_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063162u)

