HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 3DCE, Read Data and Bit Flip Register 55 */
#define MTU_MC61_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCEu)

/** \brief 3DD0, Read Data and Bit Flip Register 56 */
#define MTU_MC61_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD0u)

/** \brief 3DD2, Read Data and Bit Flip Register 57 */
#define MTU_MC61_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD2u)

/** \brief 3DD4, Read Data and Bit Flip Register 58 */
#define MTU_MC61_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD4u)

/** \brief 3DD6, Read Data and Bit Flip Register 59 */
#define MTU_MC61_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD6u)

/** \brief 3DD8, Read Data and Bit Flip Register 60 */
#define MTU_MC61_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD8u)

/** \brief 3DDA, Read Data and Bit Flip Register 61 */
#define MTU_MC61_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDAu)

/** \brief 3DDC, Read Data and Bit Flip Register 62 */
#define MTU_MC61_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDCu)

/** \brief 3DDE, Read Data and Bit Flip Register 63 */
#define MTU_MC61_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDEu)

/** \brief 3DE0, Read Data and Bit Flip Register 64 */
#define MTU_MC61_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE0u)

/** \brief 3DE2, Read Data and Bit Flip Register 65 */
#define MTU_MC61_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE2u)

/** \brief 3DE4, Read Data and Bit Flip Register 66 */
#define MTU_MC61_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE4u)

/** \brief 3DEE, Alarm Sources Configuration Register */
#define MTU_MC61_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064DEEu)

/** \brief 3DF0, SSH Safety Faults Status Register  */
#define MTU_MC61_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064DF0u)

/** \brief 3DF2, Error Information Register 0 */
#define MTU_MC61_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF2u)

/** \brief 3DF4, Error Information Register 1 */
#define MTU_MC61_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF4u)

/** \brief 3DF6, Error Information Register 2 */
#define MTU_MC61_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF6u)

/** \brief 3DF8, Error Information Register 3 */
#define MTU_MC61_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF8u)

/** \brief 3DFA, Error Information Register 4 */
#define MTU_MC61_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DFAu)

/** \brief 3E00, Configuration Registers */
#define MTU_MC62_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064E00u)

/** \brief 3E02, Configuration Register 1 */
#define MTU_MC62_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064E02u)

/** \brief 3E04, MBIST Control Register */
#define MTU_MC62_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064E04u)

/** \brief 3E06, Status Register */
#define MTU_MC62_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064E06u)

/** \brief 3E08, Range Register, single address mode */
#define MTU_MC62_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064E08u)

/** \brief 3E0C, Revision ID Register */
#define MTU_MC62_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064E0Cu)

/** \brief 3E0E, ECC Safety Register */
#define MTU_MC62_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064E0Eu)

/** \brief 3E10, Memory ECC Detection Register */
#define MTU_MC62_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064E10u)

/** \brief 3E12, Error Tracking Register 0 */
#define MTU_MC62_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E12u)

/** \brief 3E14, Error Tracking Register 1 */
#define MTU_MC62_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E14u)

/** \brief 3E16, Error Tracking Register 2 */
#define MTU_MC62_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E16u)

/** \brief 3E18, Error Tracking Register 3 */
#define MTU_MC62_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E18u)

/** \brief 3E1A, Error Tracking Register 4 */
#define MTU_MC62_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E1Au)

/** \brief 3E60, Read Data and Bit Flip Register 0 */
#define MTU_MC62_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E60u)

/** \brief 3E62, Read Data and Bit Flip Register 1 */
#define MTU_MC62_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E62u)

/** \brief 3E64, Read Data and Bit Flip Register 2 */
#define MTU_MC62_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E64u)

/** \brief 3E66, Read Data and Bit Flip Register 3 */
#define MTU_MC62_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E66u)

/** \brief 3E68, Read Data and Bit Flip Register 4 */
#define MTU_MC62_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E68u)

/** \brief 3E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC62_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Au)

/** \brief 3E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC62_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Cu)

/** \brief 3E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC62_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Eu)

/** \brief 3E70, Read Data and Bit Flip Register 8 */
#define MTU_MC62_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E70u)

/** \brief 3E72, Read Data and Bit Flip Register 9 */
#define MTU_MC62_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E72u)

/** \brief 3E74, Read Data and Bit Flip Register 10 */
#define MTU_MC62_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E74u)

/** \brief 3E76, Read Data and Bit Flip Register 11 */
#define MTU_MC62_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E76u)

/** \brief 3E78, Read Data and Bit Flip Register 12 */
#define MTU_MC62_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E78u)

/** \brief 3E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC62_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Au)

