HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 437C, Read Data and Bit Flip Register 14 */
#define MTU_MC67_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006537Cu)

/** \brief 437E, Read Data and Bit Flip Register 15 */
#define MTU_MC67_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006537Eu)

/** \brief 4380, Read Data and Bit Flip Register 16 */
#define MTU_MC67_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065380u)

/** \brief 4382, Read Data and Bit Flip Register 17 */
#define MTU_MC67_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065382u)

/** \brief 4384, Read Data and Bit Flip Register 18 */
#define MTU_MC67_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065384u)

/** \brief 4386, Read Data and Bit Flip Register 19 */
#define MTU_MC67_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065386u)

/** \brief 4388, Read Data and Bit Flip Register 20 */
#define MTU_MC67_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065388u)

/** \brief 438A, Read Data and Bit Flip Register 21 */
#define MTU_MC67_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Au)

/** \brief 438C, Read Data and Bit Flip Register 22 */
#define MTU_MC67_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Cu)

/** \brief 438E, Read Data and Bit Flip Register 23 */
#define MTU_MC67_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Eu)

/** \brief 4390, Read Data and Bit Flip Register 24 */
#define MTU_MC67_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065390u)

/** \brief 4392, Read Data and Bit Flip Register 25 */
#define MTU_MC67_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065392u)

/** \brief 4394, Read Data and Bit Flip Register 26 */
#define MTU_MC67_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065394u)

/** \brief 4396, Read Data and Bit Flip Register 27 */
#define MTU_MC67_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065396u)

/** \brief 4398, Read Data and Bit Flip Register 28 */
#define MTU_MC67_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065398u)

/** \brief 439A, Read Data and Bit Flip Register 29 */
#define MTU_MC67_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Au)

/** \brief 439C, Read Data and Bit Flip Register 30 */
#define MTU_MC67_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Cu)

/** \brief 439E, Read Data and Bit Flip Register 31 */
#define MTU_MC67_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Eu)

/** \brief 43A0, Read Data and Bit Flip Register 32 */
#define MTU_MC67_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A0u)

/** \brief 43A2, Read Data and Bit Flip Register 33 */
#define MTU_MC67_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A2u)

/** \brief 43A4, Read Data and Bit Flip Register 34 */
#define MTU_MC67_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A4u)

/** \brief 43A6, Read Data and Bit Flip Register 35 */
#define MTU_MC67_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A6u)

/** \brief 43A8, Read Data and Bit Flip Register 36 */
#define MTU_MC67_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A8u)

/** \brief 43AA, Read Data and Bit Flip Register 37 */
#define MTU_MC67_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653AAu)

/** \brief 43AC, Read Data and Bit Flip Register 38 */
#define MTU_MC67_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653ACu)

/** \brief 43AE, Read Data and Bit Flip Register 39 */
#define MTU_MC67_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653AEu)

/** \brief 43B0, Read Data and Bit Flip Register 40 */
#define MTU_MC67_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B0u)

/** \brief 43B2, Read Data and Bit Flip Register 41 */
#define MTU_MC67_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B2u)

/** \brief 43B4, Read Data and Bit Flip Register 42 */
#define MTU_MC67_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B4u)

/** \brief 43B6, Read Data and Bit Flip Register 43 */
#define MTU_MC67_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B6u)

/** \brief 43B8, Read Data and Bit Flip Register 44 */
#define MTU_MC67_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B8u)

/** \brief 43BA, Read Data and Bit Flip Register 45 */
#define MTU_MC67_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BAu)

/** \brief 43BC, Read Data and Bit Flip Register 46 */
#define MTU_MC67_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BCu)

/** \brief 43BE, Read Data and Bit Flip Register 47 */
#define MTU_MC67_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BEu)

/** \brief 43C0, Read Data and Bit Flip Register 48 */
#define MTU_MC67_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C0u)

/** \brief 43C2, Read Data and Bit Flip Register 49 */
#define MTU_MC67_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C2u)

/** \brief 43C4, Read Data and Bit Flip Register 50 */
#define MTU_MC67_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C4u)

/** \brief 43C6, Read Data and Bit Flip Register 51 */
#define MTU_MC67_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C6u)

/** \brief 43C8, Read Data and Bit Flip Register 52 */
#define MTU_MC67_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C8u)

/** \brief 43CA, Read Data and Bit Flip Register 53 */
#define MTU_MC67_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CAu)

/** \brief 43CC, Read Data and Bit Flip Register 54 */
#define MTU_MC67_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CCu)

/** \brief 43CE, Read Data and Bit Flip Register 55 */
#define MTU_MC67_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CEu)

/** \brief 43D0, Read Data and Bit Flip Register 56 */
#define MTU_MC67_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D0u)

/** \brief 43D2, Read Data and Bit Flip Register 57 */
#define MTU_MC67_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D2u)

/** \brief 43D4, Read Data and Bit Flip Register 58 */
#define MTU_MC67_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D4u)

/** \brief 43D6, Read Data and Bit Flip Register 59 */
#define MTU_MC67_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D6u)

/** \brief 43D8, Read Data and Bit Flip Register 60 */
#define MTU_MC67_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D8u)

/** \brief 43DA, Read Data and Bit Flip Register 61 */
#define MTU_MC67_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DAu)

/** \brief 43DC, Read Data and Bit Flip Register 62 */
#define MTU_MC67_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DCu)

/** \brief 43DE, Read Data and Bit Flip Register 63 */
#define MTU_MC67_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DEu)

/** \brief 43E0, Read Data and Bit Flip Register 64 */
#define MTU_MC67_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E0u)

/** \brief 43E2, Read Data and Bit Flip Register 65 */
#define MTU_MC67_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E2u)

/** \brief 43E4, Read Data and Bit Flip Register 66 */
#define MTU_MC67_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E4u)

/** \brief 43EE, Alarm Sources Configuration Register */
#define MTU_MC67_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00653EEu)

/** \brief 43F0, SSH Safety Faults Status Register  */
#define MTU_MC67_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00653F0u)

/** \brief 43F2, Error Information Register 0 */
#define MTU_MC67_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F2u)

/** \brief 43F4, Error Information Register 1 */
#define MTU_MC67_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F4u)

/** \brief 43F6, Error Information Register 2 */
#define MTU_MC67_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F6u)

/** \brief 43F8, Error Information Register 3 */
#define MTU_MC67_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F8u)

/** \brief 43FA, Error Information Register 4 */
#define MTU_MC67_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653FAu)

/** \brief 4400, Configuration Registers */
#define MTU_MC68_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065400u)

/** \brief 4402, Configuration Register 1 */
#define MTU_MC68_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065402u)

/** \brief 4404, MBIST Control Register */
#define MTU_MC68_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065404u)

/** \brief 4406, Status Register */
#define MTU_MC68_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065406u)

/** \brief 4408, Range Register, single address mode */
#define MTU_MC68_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065408u)

/** \brief 440C, Revision ID Register */
#define MTU_MC68_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006540Cu)

/** \brief 440E, ECC Safety Register */
#define MTU_MC68_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006540Eu)

/** \brief 4410, Memory ECC Detection Register */
#define MTU_MC68_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065410u)

/** \brief 4412, Error Tracking Register 0 */
#define MTU_MC68_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065412u)

/** \brief 4414, Error Tracking Register 1 */
#define MTU_MC68_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065414u)

/** \brief 4416, Error Tracking Register 2 */
#define MTU_MC68_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065416u)

/** \brief 4418, Error Tracking Register 3 */
#define MTU_MC68_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065418u)

/** \brief 441A, Error Tracking Register 4 */
#define MTU_MC68_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006541Au)

/** \brief 4460, Read Data and Bit Flip Register 0 */
#define MTU_MC68_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065460u)

