HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 48EE, Alarm Sources Configuration Register */
#define MTU_MC72_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00658EEu)

/** \brief 48F0, SSH Safety Faults Status Register  */
#define MTU_MC72_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00658F0u)

/** \brief 48F2, Error Information Register 0 */
#define MTU_MC72_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F2u)

/** \brief 48F4, Error Information Register 1 */
#define MTU_MC72_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F4u)

/** \brief 48F6, Error Information Register 2 */
#define MTU_MC72_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F6u)

/** \brief 48F8, Error Information Register 3 */
#define MTU_MC72_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F8u)

/** \brief 48FA, Error Information Register 4 */
#define MTU_MC72_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658FAu)

/** \brief 4900, Configuration Registers */
#define MTU_MC73_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065900u)

/** \brief 4902, Configuration Register 1 */
#define MTU_MC73_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065902u)

/** \brief 4904, MBIST Control Register */
#define MTU_MC73_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065904u)

/** \brief 4906, Status Register */
#define MTU_MC73_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065906u)

/** \brief 4908, Range Register, single address mode */
#define MTU_MC73_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065908u)

/** \brief 490C, Revision ID Register */
#define MTU_MC73_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006590Cu)

/** \brief 490E, ECC Safety Register */
#define MTU_MC73_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006590Eu)

/** \brief 4910, Memory ECC Detection Register */
#define MTU_MC73_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065910u)

/** \brief 4912, Error Tracking Register 0 */
#define MTU_MC73_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065912u)

/** \brief 4914, Error Tracking Register 1 */
#define MTU_MC73_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065914u)

/** \brief 4916, Error Tracking Register 2 */
#define MTU_MC73_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065916u)

/** \brief 4918, Error Tracking Register 3 */
#define MTU_MC73_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065918u)

/** \brief 491A, Error Tracking Register 4 */
#define MTU_MC73_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006591Au)

/** \brief 4960, Read Data and Bit Flip Register 0 */
#define MTU_MC73_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065960u)

/** \brief 4962, Read Data and Bit Flip Register 1 */
#define MTU_MC73_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065962u)

/** \brief 4964, Read Data and Bit Flip Register 2 */
#define MTU_MC73_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065964u)

/** \brief 4966, Read Data and Bit Flip Register 3 */
#define MTU_MC73_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065966u)

/** \brief 4968, Read Data and Bit Flip Register 4 */
#define MTU_MC73_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065968u)

/** \brief 496A, Read Data and Bit Flip Register 5 */
#define MTU_MC73_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Au)

/** \brief 496C, Read Data and Bit Flip Register 6 */
#define MTU_MC73_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Cu)

/** \brief 496E, Read Data and Bit Flip Register 7 */
#define MTU_MC73_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Eu)

/** \brief 4970, Read Data and Bit Flip Register 8 */
#define MTU_MC73_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065970u)

/** \brief 4972, Read Data and Bit Flip Register 9 */
#define MTU_MC73_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065972u)

/** \brief 4974, Read Data and Bit Flip Register 10 */
#define MTU_MC73_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065974u)

/** \brief 4976, Read Data and Bit Flip Register 11 */
#define MTU_MC73_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065976u)

/** \brief 4978, Read Data and Bit Flip Register 12 */
#define MTU_MC73_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065978u)

/** \brief 497A, Read Data and Bit Flip Register 13 */
#define MTU_MC73_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Au)

/** \brief 497C, Read Data and Bit Flip Register 14 */
#define MTU_MC73_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Cu)

/** \brief 497E, Read Data and Bit Flip Register 15 */
#define MTU_MC73_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Eu)

/** \brief 4980, Read Data and Bit Flip Register 16 */
#define MTU_MC73_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065980u)

/** \brief 4982, Read Data and Bit Flip Register 17 */
#define MTU_MC73_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065982u)

/** \brief 4984, Read Data and Bit Flip Register 18 */
#define MTU_MC73_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065984u)

/** \brief 4986, Read Data and Bit Flip Register 19 */
#define MTU_MC73_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065986u)

/** \brief 4988, Read Data and Bit Flip Register 20 */
#define MTU_MC73_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065988u)

/** \brief 498A, Read Data and Bit Flip Register 21 */
#define MTU_MC73_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Au)

/** \brief 498C, Read Data and Bit Flip Register 22 */
#define MTU_MC73_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Cu)

/** \brief 498E, Read Data and Bit Flip Register 23 */
#define MTU_MC73_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Eu)

/** \brief 4990, Read Data and Bit Flip Register 24 */
#define MTU_MC73_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065990u)

