HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMtu_reg.h
/** \brief 5BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC91_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCCu)

/** \brief 5BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC91_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCEu)

/** \brief 5BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC91_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD0u)

/** \brief 5BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC91_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD2u)

/** \brief 5BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC91_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD4u)

/** \brief 5BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC91_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD6u)

/** \brief 5BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC91_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD8u)

/** \brief 5BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC91_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDAu)

/** \brief 5BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC91_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDCu)

/** \brief 5BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC91_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDEu)

/** \brief 5BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC91_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE0u)

/** \brief 5BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC91_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE2u)

/** \brief 5BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC91_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE4u)

/** \brief 5BEE, Alarm Sources Configuration Register */
#define MTU_MC91_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0066BEEu)

/** \brief 5BF0, SSH Safety Faults Status Register  */
#define MTU_MC91_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0066BF0u)

/** \brief 5BF2, Error Information Register 0 */
#define MTU_MC91_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF2u)

/** \brief 5BF4, Error Information Register 1 */
#define MTU_MC91_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF4u)

/** \brief 5BF6, Error Information Register 2 */
#define MTU_MC91_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF6u)

/** \brief 5BF8, Error Information Register 3 */
#define MTU_MC91_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF8u)

/** \brief 5BFA, Error Information Register 4 */
#define MTU_MC91_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BFAu)

/** \brief 5C00, Configuration Registers */
#define MTU_MC92_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066C00u)

/** \brief 5C02, Configuration Register 1 */
#define MTU_MC92_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066C02u)

/** \brief 5C04, MBIST Control Register */
#define MTU_MC92_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066C04u)

/** \brief 5C06, Status Register */
#define MTU_MC92_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066C06u)

/** \brief 5C08, Range Register, single address mode */
#define MTU_MC92_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066C08u)

/** \brief 5C0C, Revision ID Register */
#define MTU_MC92_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066C0Cu)

/** \brief 5C0E, ECC Safety Register */
#define MTU_MC92_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066C0Eu)

/** \brief 5C10, Memory ECC Detection Register */
#define MTU_MC92_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066C10u)

/** \brief 5C12, Error Tracking Register 0 */
#define MTU_MC92_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C12u)

/** \brief 5C14, Error Tracking Register 1 */
#define MTU_MC92_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C14u)

/** \brief 5C16, Error Tracking Register 2 */
#define MTU_MC92_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C16u)

/** \brief 5C18, Error Tracking Register 3 */
#define MTU_MC92_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C18u)

/** \brief 5C1A, Error Tracking Register 4 */
#define MTU_MC92_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C1Au)

/** \brief 5C60, Read Data and Bit Flip Register 0 */
#define MTU_MC92_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C60u)

/** \brief 5C62, Read Data and Bit Flip Register 1 */
#define MTU_MC92_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C62u)

/** \brief 5C64, Read Data and Bit Flip Register 2 */
#define MTU_MC92_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C64u)

/** \brief 5C66, Read Data and Bit Flip Register 3 */
#define MTU_MC92_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C66u)

/** \brief 5C68, Read Data and Bit Flip Register 4 */
#define MTU_MC92_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C68u)

/** \brief 5C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC92_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Au)

/** \brief 5C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC92_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Cu)

/** \brief 5C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC92_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Eu)

/** \brief 5C70, Read Data and Bit Flip Register 8 */
#define MTU_MC92_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C70u)

/** \brief 5C72, Read Data and Bit Flip Register 9 */
#define MTU_MC92_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C72u)

